# 2. Для списка реализовать обмен значений соседних элементов, т.е. Значениями обмениваются элементы
# с индексами 0 и 1, 2 и 3 и т.д. При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

# запрос количества элементов списка у пользователя
n_elements = int(input("Введите количество элементов в списке: "))

# заполнение списка
list_1 = [input(f"Введите {i + 1} элемент списка: ") for i in range(n_elements)]

# обмен значениями соседних элементов:
for i in range(0, len(list_1) - 1, 2):
    list_1[i], list_1[i + 1] = list_1[i + 1], list_1[i]

# Вывод измененного списка
print(list_1)
